Функция ОпределитьНомерПрививки(Сотрудник, Дата, Компонент) Экспорт 
	Если Компонент = 0 Тогда 
		Сообщить("ОШИБКА: В функцию ""ОпределитьНомерПрививки"" передан нулевой номер компоненты вакцины");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаВакцинации", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	COV_ПрохождениеВакцинацииОтCOVID.Сотрудник КАК Сотрудник,
	|	СУММА(ВЫБОР
	|			КОГДА COV_ПрохождениеВакцинацииОтCOVID.ТипВакцины.КоличествоКомпонентов = 1
	|				ТОГДА 2
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Номер
	|ИЗ
	|	РегистрСведений.COV_ПрохождениеВакцинацииОтCOVID КАК COV_ПрохождениеВакцинацииОтCOVID
	|ГДЕ
	|	COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|	И COV_ПрохождениеВакцинацииОтCOVID.ДатаВакцинации < &ДатаВакцинации
	|
	|СГРУППИРОВАТЬ ПО
	|	COV_ПрохождениеВакцинацииОтCOVID.Сотрудник";
	
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество() = 0 Тогда 
		Возврат 1 + Компонент/10;
	Иначе 
		Результат.Следующий();
		Возврат 1 + Цел(Результат.Номер / 2) + Компонент/10;
	КонецЕсли;
	
КонецФункции
// Параметры:
// ПараметрыВакцинации - структура с полем Ключ - "Сотрудники" Значение - массив строк табличной части Сотрудники
Процедура РассчитатьНомераПрививок(ПараметрыВакцинации) Экспорт 
	Если ТипЗнч(ПараметрыВакцинации) <> Тип("Структура") 
		Или Не ПараметрыВакцинации.Свойство("Сотрудники")
		Тогда 
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаТЧ Из ПараметрыВакцинации.Сотрудники Цикл 
		СтрокаТЧ.НомерПрививки = ОпределитьНомерПрививки(СтрокаТЧ.Сотрудник, СтрокаТЧ.ДатаВакцинации, СтрокаТЧ.КомпонентВакцины);
	КонецЦикла;
КонецПроцедуры





