
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДокументОснование") Тогда // на основании
		Если ТипЗнч(Параметры.ДокументОснование) = Тип("ДокументСсылка.COV_ПрохождениеВакцинацииГрупповой") Тогда 
			Объект.ДокументОснование = Параметры.ДокументОснование;
			Объект.НачалоДействияСертификата = Параметры.ДатаВакцинации;
			Объект.КонецДействияСертификата = ДобавитьМесяц(Параметры.ДатаВакцинации, 12)-1;
			Объект.СертификатДействителен = Истина;
			Объект.Сотрудник = Параметры.Сотрудник;
			Объект.ТипВакцины = Параметры.ТипВакцины;
			Объект.ОснованиеДействияССертификатом = Параметры.ОснованиеДействияССертификатом;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда // ЭтоНовый
		Объект.СертификатДействителен = Истина;
	КонецЕсли;
	
КонецПроцедуры



