
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если    Неопределено = ПараметрыВыполненияКоманды.Источник
		Или Неопределено = ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент
		Или "Сотрудники" <> ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.Имя
		Или Неопределено = ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.ТекущиеДанные
		Тогда 
		Возврат;
	КонецЕсли;
	Данные = ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("ДатаВакцинации, Сотрудник, ТипВакцины, ДокументОснование");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Данные);
	ПараметрыФормы.Вставить("ДокументОснование", ПараметрКоманды);
	ПараметрыФормы.Вставить("ОснованиеДействияССертификатом", "на основании прививки");
	СтрРезультат = ПолучитьВозможностьСозданияСертификата(ПараметрКоманды, ПараметрыФормы.Сотрудник);
	Если СтрРезультат.Возможность Тогда 
		ОткрытьФорму("Документ.COV_СертификатОВакцинацииОтCOVID.ФормаОбъекта", ПараметрыФормы);
	Иначе 
		Для Каждого ссСертификат Из СтрРезультат.Данные Цикл 
			Если ссСертификат.Сертификат = 0 Тогда 
				Оповещение = Новый ОписаниеОповещения("ОбработатьНажатиеНаСсылку", ЭтотОбъект,  ссСертификат.Сертификат);
				ПоказатьОповещениеПользователя("Сертификат не создан"
				, Неопределено
				, СтрРезультат.ТекстПричины
				, БиблиотекаКартинок.Обработка);
			Иначе 
				Оповещение = Новый ОписаниеОповещения("ОбработатьНажатиеНаСсылку", ЭтотОбъект,  ссСертификат.Сертификат);
				ПоказатьОповещениеПользователя("Уже созданы сертификаты:"
				, Оповещение
				, Строка(ссСертификат.Сертификат)
				, БиблиотекаКартинок.Обработка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеНаСсылку(Параметры) Экспорт 
	ОткрытьЗначение(Параметры);
КонецПроцедуры

&НаСервере
Функция ПолучитьВозможностьСозданияСертификата(ДокументСсылка, Сотрудник)
	Возврат Документы.COV_СертификатОВакцинацииОтCOVID.ПолучитьВозможностьСозданияСертификата(ДокументСсылка, Сотрудник);
КонецФункции


