
&НаСервере
Процедура СертификатПриИзмененииНаСервере()
	Объект.НачалоДействияСертификата = Объект.Сертификат.НачалоДействияСертификата;
	Объект.КонецДействияСертификата = Объект.Сертификат.КонецДействияСертификата;
КонецПроцедуры

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	СертификатПриИзмененииНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Функция СертификатНачалоВыбораНаСервере(Сотрудник)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст = "ВЫБРАТЬ
	|	COV_СертификатОВакцинацииОтCOVID.Ссылка КАК Сертификат
	|ИЗ
	|	Документ.COV_СертификатОВакцинацииОтCOVID КАК COV_СертификатОВакцинацииОтCOVID
	|ГДЕ
	|	COV_СертификатОВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|	И НЕ COV_СертификатОВакцинацииОтCOVID.ПометкаУдаления";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сертификат");
КонецФункции

&НаКлиенте
Процедура СертификатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.СписокВыбора.Очистить();
	мсСертификатыСотрудника = СертификатНачалоВыбораНаСервере(Объект.Сотрудник);
	Элемент.СписокВыбора.ЗагрузитьЗначения(мсСертификатыСотрудника);
КонецПроцедуры
