Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.COV_ПрохождениеВакцинацииОтCOVID.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.COV_ПрохождениеВакцинацииОтCOVID.Добавить();
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.ВидВакцины = ВидВакцинации;
		Движение.ТипВакцины = ТекСтрокаСотрудники.ТипВакцины;
		Движение.ДатаВакцинации = ТекСтрокаСотрудники.ДатаВакцинации;
		Движение.Компонент = ТекСтрокаСотрудники.КомпонентВакцины;
		Движение.НомерПрививки = ТекСтрокаСотрудники.НомерПрививки;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	мсСтрокТЧ = Новый Массив;
	Для Каждого строкаТЧ Из Сотрудники Цикл 
		мсСтрокТЧ.Добавить(строкаТЧ);
	КонецЦикла;
	ПараметрыВакцинации = Новый Структура("Сотрудники", мсСтрокТЧ);
	COV_ОбщегоНазначения.РассчитатьНомераПрививок(ПараметрыВакцинации);
	
	Для Каждого строкаТЧ Из ПараметрыВакцинации.Сотрудники Цикл 
		изм = Сотрудники.Получить(Сотрудники.Индекс(строкаТЧ));
		ЗаполнитьЗначенияСвойств(изм, строкаТЧ, "НомерПрививки");
	КонецЦикла;
	
КонецПроцедуры
