Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.COV_ПрохождениеВакцинацииОтCOVID.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.COV_ПрохождениеВакцинацииОтCOVID.Добавить();
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.ВидВакцины = ВидВакцинации;
		Движение.ТипВакцины = ТекСтрокаСотрудники.ТипВакцины;
		Движение.ДатаВакцинации = ТекСтрокаСотрудники.ДатаВакцинации;
		Движение.Компонент = ТекСтрокаСотрудники.КомпонентВакцины;
	КонецЦикла;
КонецПроцедуры
