
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр COV_МедицинскиеОтводыОтВакцинации
	Движения.COV_МедицинскиеОтводыОтВакцинации.Записывать = Истина;
	Движение = Движения.COV_МедицинскиеОтводыОтВакцинации.Добавить();
	Движение.Сотрудник = Сотрудник;
	Движение.ПериодДействияНачало = НачалоДействия;
	Движение.ПериодДействияКонец = КонецДействия;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
