
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.COV_ПрохождениеВакцинацииОтCOVID.Записывать = Истина;
	Для Каждого ТекСтрокаВакцинации Из Вакцинации Цикл
		Движение = Движения.COV_ПрохождениеВакцинацииОтCOVID.Добавить();
		Движение.Сотрудник = Сотрудник;
		Движение.ВидВакцины = ВидВакцинации;
		Движение.ТипВакцины = ТекСтрокаВакцинации.ТипВакцины;
		Движение.ДатаВакцинации = ТекСтрокаВакцинации.ДатаВакцинации;
		Движение.Компонент = ТекСтрокаВакцинации.КомпонентВакцины;
		Движение.НомерПрививки = ТекСтрокаВакцинации.НомерПрививки;
	КонецЦикла;

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда 
		Для Каждого СтрокаТЧ Из Вакцинации Цикл 
			СтрокаТЧ.НомерПрививки = COV_ОбщегоНазначения.ОпределитьНомерПрививки(Сотрудник,СтрокаТЧ.ДатаВакцинации, СтрокаТЧ.КомпонентВакцины);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

