
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр COV_ПрохождениеВакцинацииОтCOVID
	Движения.COV_ПрохождениеВакцинацииОтCOVID.Записывать = Истина;
	Для Каждого ТекСтрокаВакцинации Из Вакцинации Цикл
		Движение = Движения.COV_ПрохождениеВакцинацииОтCOVID.Добавить();
		Движение.Сотрудник = Сотрудник;
		Движение.ВидВакцины = ВидВакцинации;
		Движение.ТипВакцины = ТекСтрокаВакцинации.ТипВакцины;
		Движение.ДатаВакцинации = ТекСтрокаВакцинации.ДатаВакцинации;
		Движение.Компонент = ТекСтрокаВакцинации.КомпонентВакцины;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
