#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ДезактивироватьСертификат(Сертификат, ПричинаДезактивации = "") Экспорт 
	Перем Результат;
	Результат = Новый Структура("Сертификат, Успешно, ТекстОшибки", Сертификат, Истина, "");
	Попытка
		ОбъектСертификата = Сертификат.ПолучитьОбъект();
		ОбъектСертификата.СертификатДействителен = Ложь;
		ОбъектСертификата.ОснованиеДействияССертификатом = ПричинаДезактивации;
		ОбъектСертификата.Записать();
		Возврат Результат;
	Исключение
		мОписаниеОшибки = ОписаниеОшибки();
		Результат.ТекстОшибки = мОписаниеОшибки;
		Результат.Успех = Ложь;
		Возврат Результат;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьВозможностьСозданияСертификата(ДокументВакцинации, Сотрудник) Экспорт 
	Перем СтруктураРезультата;
	СтруктураРезультата = Новый Структура("Возможность, Данные, ТекстПричины");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументВакцинации);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(COV_ПрохождениеВакцинацииОтCOVID.Компонент) КАК Компонент
	|ПОМЕСТИТЬ вт_МаксимальныйКомпонент
	|ИЗ
	|	РегистрСведений.COV_ПрохождениеВакцинацииОтCOVID КАК COV_ПрохождениеВакцинацииОтCOVID
	|ГДЕ
	|	COV_ПрохождениеВакцинацииОтCOVID.Регистратор = &Ссылка
	|	И COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	COV_ПрохождениеВакцинацииОтCOVID.ДатаВакцинации КАК ДатаВакцинации,
	|	COV_ПрохождениеВакцинацииОтCOVID.ТипВакцины КАК ТипВакцины,
	|	ЕСТЬNULL(СуществующиеСертификаты.Ссылка, 0) КАК Сертификат,
	|	COV_ПрохождениеВакцинацииОтCOVID.Компонент <> COV_ПрохождениеВакцинацииОтCOVID.ТипВакцины.КоличествоКомпонентов КАК Отказ,
	|	COV_ПрохождениеВакцинацииОтCOVID.Компонент КАК КомпонентВакцины
	|ИЗ
	|	вт_МаксимальныйКомпонент КАК вт_МаксимальныйКомпонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.COV_ПрохождениеВакцинацииОтCOVID КАК COV_ПрохождениеВакцинацииОтCOVID
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				COV_СертификатОВакцинацииОтCOVID.Ссылка КАК Ссылка,
	|				COV_СертификатОВакцинацииОтCOVID.НачалоДействияСертификата КАК НачалоДействияСертификата,
	|				COV_СертификатОВакцинацииОтCOVID.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.COV_СертификатОВакцинацииОтCOVID КАК COV_СертификатОВакцинацииОтCOVID
	|			ГДЕ
	|				НЕ COV_СертификатОВакцинацииОтCOVID.ПометкаУдаления) КАК СуществующиеСертификаты
	|			ПО COV_ПрохождениеВакцинацииОтCOVID.ДатаВакцинации = СуществующиеСертификаты.НачалоДействияСертификата
	|				И COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = СуществующиеСертификаты.Сотрудник
	|		ПО вт_МаксимальныйКомпонент.Компонент = COV_ПрохождениеВакцинацииОтCOVID.Компонент
	|ГДЕ
	|	COV_ПрохождениеВакцинацииОтCOVID.Регистратор = &Ссылка
	|	И COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|";
	
	
	Результат = Запрос.Выполнить().Выбрать();
	СтруктураРезультата.Данные = СтруктураИзВыборки(Результат);
	СтруктураРезультата.Возможность = Истина;
	Результат.Сбросить();
	
	Если Результат.Следующий() Тогда 
		Если Результат.Сертификат <> 0 Тогда 
			СтруктураРезультата.ТекстПричины = "Сертификат уже создан: 
			|" + Результат.Сертификат;
			СтруктураРезультата.Возможность = Ложь;
		КонецЕсли;
		Если Результат.ДатаВакцинации = NULL Или Результат.Отказ Тогда 
			СтруктураРезультата.ТекстПричины = "Получено недостаточно компонентов вакцины: " + Результат.КомпонентВакцины;
			СтруктураРезультата.Возможность = Ложь;
		КонецЕсли;
		
		Возврат СтруктураРезультата;
	Иначе   // недостижимый код
		СтруктураРезультата.ТекстПричины = "Недостаточно компонентов вакцины получено: " + Результат.КомпонентВакцины;
		СтруктураРезультата.Возможность = Ложь;
	КонецЕсли;
	Возврат СтруктураРезультата;	
КонецФункции

Функция СтруктураИзВыборки(Выборка)
	МассивРезультата = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Поля = Новый Структура;
		Для каждого Колонка Из Выборка.Владелец().Колонки Цикл
			Поля.Вставить(Колонка.Имя);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(Поля, Выборка);
		МассивРезультата.Добавить(Поля);
	КонецЦикла;
	
	Возврат МассивРезультата;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("СертификатДействителен");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = "Сертификат о вакцинации " + ?(Данные.СертификатДействителен, "(А)", "(-)") + " " + Данные.Номер + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
КонецПроцедуры

Функция НайтиПоследнийАктивныйСертификат(Сотрудник, Дата, Ссылка = Неопределено) Экспорт 
	Перем ТекстСообщения;
	Перем прСертификат;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	COV_СертификатОВакцинацииОтCOVID.Ссылка КАК Ссылка,
	|	COV_СертификатОВакцинацииОтCOVID.Дата КАК Дата
	|ИЗ
	|	Документ.COV_СертификатОВакцинацииОтCOVID КАК COV_СертификатОВакцинацииОтCOVID
	|ГДЕ
	|	COV_СертификатОВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|	И НАЧАЛОПЕРИОДА(COV_СертификатОВакцинацииОтCOVID.НачалоДействияСертификата, ДЕНЬ) <= &Дата
	|	И COV_СертификатОВакцинацииОтCOVID.СертификатДействителен
	|	И НЕ COV_СертификатОВакцинацииОтCOVID.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &Ссылка = ЗНАЧЕНИЕ(Документ.COV_СертификатОВакцинацииОтCOVID.ПустаяСсылка)
	|					ИЛИ &Ссылка = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ &Ссылка <> COV_СертификатОВакцинацииОтCOVID.Ссылка
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Сертификат = Запрос.Выполнить().Выбрать();
	
	Если Сертификат.Следующий() Тогда 
		Возврат Сертификат.Ссылка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецЕсли