
Функция ПолучитьВозможностьСозданияСертификата(ДокументВакцинации, Сотрудник) Экспорт 
	Перем СтруктураРезультата;
	СтруктураРезультата = Новый Структура("Возможность, Данные, ТекстПричины");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументВакцинации);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(COV_ПрохождениеВакцинацииОтCOVID.Компонент) КАК Компонент
	|ПОМЕСТИТЬ вт_МаксимальныйКомпонент
	|ИЗ
	|	РегистрСведений.COV_ПрохождениеВакцинацииОтCOVID КАК COV_ПрохождениеВакцинацииОтCOVID
	|ГДЕ
	|	COV_ПрохождениеВакцинацииОтCOVID.Регистратор = &Ссылка
	|	И COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	COV_ПрохождениеВакцинацииОтCOVID.ДатаВакцинации КАК ДатаВакцинации,
	|	COV_ПрохождениеВакцинацииОтCOVID.ТипВакцины КАК ТипВакцины,
	|	ЕСТЬNULL(СуществующиеСертификаты.Ссылка, 0) КАК Сертификат,
	|	COV_ПрохождениеВакцинацииОтCOVID.Компонент <> COV_ПрохождениеВакцинацииОтCOVID.ТипВакцины.КоличествоКомпонентов КАК Отказ,
	|	COV_ПрохождениеВакцинацииОтCOVID.Компонент КАК КомпонентВакцины
	|ИЗ
	|	вт_МаксимальныйКомпонент КАК вт_МаксимальныйКомпонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.COV_ПрохождениеВакцинацииОтCOVID КАК COV_ПрохождениеВакцинацииОтCOVID
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				COV_СертификатОВакцинацииОтCOVID.Ссылка КАК Ссылка,
	|				COV_СертификатОВакцинацииОтCOVID.НачалоДействияСертификата КАК НачалоДействияСертификата,
	|				COV_СертификатОВакцинацииОтCOVID.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.COV_СертификатОВакцинацииОтCOVID КАК COV_СертификатОВакцинацииОтCOVID
	|			ГДЕ
	|				НЕ COV_СертификатОВакцинацииОтCOVID.ПометкаУдаления) КАК СуществующиеСертификаты
	|			ПО COV_ПрохождениеВакцинацииОтCOVID.ДатаВакцинации = СуществующиеСертификаты.НачалоДействияСертификата
	|				И COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = СуществующиеСертификаты.Сотрудник
	|		ПО вт_МаксимальныйКомпонент.Компонент = COV_ПрохождениеВакцинацииОтCOVID.Компонент
	|ГДЕ
	|	COV_ПрохождениеВакцинацииОтCOVID.Регистратор = &Ссылка
	|	И COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|";
	
	
	Результат = Запрос.Выполнить().Выбрать();
	СтруктураРезультата.Данные = СтруктураИзВыборки(Результат);
	СтруктураРезультата.Возможность = Истина;
	Результат.Сбросить();
	
	Если Результат.Следующий() Тогда 
		Если Результат.Сертификат <> 0 Тогда 
			СтруктураРезультата.ТекстПричины = "Сертификат уже создан: 
			|" + Результат.Сертификат;
			СтруктураРезультата.Возможность = Ложь;
		КонецЕсли;
		Если Результат.ДатаВакцинации = NULL Или Результат.Отказ Тогда 
			СтруктураРезультата.ТекстПричины = "Получено недостаточно компонентов вакцины: " + Результат.КомпонентВакцины;
			СтруктураРезультата.Возможность = Ложь;
		КонецЕсли;
		
		Возврат СтруктураРезультата;
	Иначе   // недостижимый код
		СтруктураРезультата.ТекстПричины = "Недостаточно компонентов вакцины получено: " + Результат.КомпонентВакцины;
		СтруктураРезультата.Возможность = Ложь;
	КонецЕсли;
	Возврат СтруктураРезультата;	
КонецФункции

Функция СтруктураИзВыборки(Выборка)
	МассивРезультата = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Поля = Новый Структура;
		Для каждого Колонка Из Выборка.Владелец().Колонки Цикл
			Поля.Вставить(Колонка.Имя);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(Поля, Выборка);
		МассивРезультата.Добавить(Поля);
	КонецЦикла;
	
	Возврат МассивРезультата;
	
КонецФункции


