
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.COV_ПрохождениеВакцинацииОтCOVID") Тогда
		СтрРезультат = Документы.COV_СертификатОВакцинацииОтCOVID.ПолучитьВозможностьСозданияСертификата(ДанныеЗаполнения, ДанныеЗаполнения.Сотрудник);
		
		Если СтрРезультат.Возможность = Ложь Тогда 
			ВызватьИсключение СтрРезультат.ТекстПричины;
		КонецЕсли;
		Данные = СтрРезультат.Данные[0];
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ТипВакцины = Данные.ТипВакцины;
		СертификатДействителен = Истина;
		НачалоДействияСертификата = Данные.ДатаВакцинации;
		КонецДействияСертификата = ДобавитьМесяц(Данные.ДатаВакцинации, 12)-1;
		ОснованиеДействияССертификатом = "на основании вакцинации";
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.COV_СертификатыОВакцинацииОтCOVID.Записывать = Истина;
	Движение = Движения.COV_СертификатыОВакцинацииОтCOVID.Добавить();
	Движение.Сотрудник = Сотрудник;
	Движение.ТипВакцины = ТипВакцины;
	Движение.ПериодДействияКонец = КонецДействияСертификата;
	Движение.Актуальный = СертификатДействителен;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если СертификатДействителен
		И РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И Не ПредыдущийСертификат.Пустая()
		Тогда 
		//РезультатДезактивации = ДезактивироватьПрежнийСертификат(Сотрудник, НачалоДействияСертификата, Ссылка);
		РезультатДезактивации = Документы.COV_СертификатОВакцинацииОтCOVID.ДезактивироватьСертификат(ПредыдущийСертификат);
		Если РезультатДезактивации.Успешно Тогда
			
			ТекстСообщения = "Устаревший сертификат деактивирован: " + Символы.ПС + Строка(РезультатДезактивации.Сертификат);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.УстановитьДанные(РезультатДезактивации.Сертификат);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			
			ПредыдущийСертификат = РезультатДезактивации.Сертификат;
		Иначе 
			ТекстСообщения = "Не удалось деактивировать: " + Символы.ПС + Строка(РезультатДезактивации.Сертификат) + " " + РезультатДезактивации.ТекстОшибки;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.УстановитьДанные(РезультатДезактивации.Сертификат);
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ДезактивироватьПрежнийСертификат(Сотрудник, Дата, Ссылка)
	
	прСертификат = Документы.COV_СертификатОВакцинацииОтCOVID.НайтиПоследнийАктивныйСертификат(Сотрудник, Дата, Ссылка);
	Если прСертификат = Неопределено Тогда 
		Возврат Неопределено;
	Иначе 
		Возврат Документы.COV_СертификатОВакцинацииОтCOVID.ДезактивироватьСертификат(прСертификат, "Получен новый сертификат " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"));
	КонецЕсли;;

КонецФункции



