
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.COV_ПрохождениеВакцинацииОтCOVID") Тогда
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ТипВакцины = ДанныеЗаполнения.Вакцинации[0].ТипВакцины;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.COV_СертификатыОВакцинацииОтCOVID.Записывать = Истина;
	Движение = Движения.COV_СертификатыОВакцинацииОтCOVID.Добавить();
	Движение.Сотрудник = Сотрудник;
	Движение.ТипВакцины = ТипВакцины;
	Движение.ПериодДействияКонец = КонецДействияСертификата;
	Движение.Актуальный = СертификатДействителен;
КонецПроцедуры
