
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр COV_ЗаболеванияКороновируснойИнфекцией
	Движения.COV_ЗаболеванияКороновируснойИнфекцией.Записывать = Истина;
	Движение = Движения.COV_ЗаболеванияКороновируснойИнфекцией.Добавить();
	Движение.Сотрудник = Сотрудник;
	Движение.ПериодДействияНачало = НачалоДействияСертификата;
	Движение.ПериодДействияКонец = КонецДействияСертификата;
	Движение.Сертификат = Сертификат;
	Движение.СрокОсвобожденияОтПрививки = СрокОсвобожденияОтПрививки;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Результат = Документы.COV_СертификатОВакцинацииОтCOVID.ДезактивироватьСертификат(Сертификат);
	Если Не Результат.Успешно Тогда 
		Сообщить(Результат.ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
