
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр COV_ЗаболеванияКороновируснойИнфекцией
	Движения.COV_ЗаболеванияКороновируснойИнфекцией.Записывать = Истина;
	Движение = Движения.COV_ЗаболеванияКороновируснойИнфекцией.Добавить();
	Движение.Сотрудник = Сотрудник;
	Движение.ПериодДействияНачало = НачалоДействияСертификата;
	Движение.ПериодДействияКонец = КонецДействияСертификата;
	Движение.Сертификат = Сертификат;
	Движение.СрокОсвобожденияОтПрививки = СрокОсвобожденияОтПрививки;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сертификат) Тогда 
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
			Инфо = Новый СообщениеПользователю;
			Инфо.Текст = "При проведении этого документа был дезактивирован 
			|" + Сертификат + "
			|Включите актуальность при необходимости.";
			
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			
			Результат = Документы.COV_СертификатОВакцинацииОтCOVID.ДезактивироватьСертификат(Сертификат);
			Если Не Результат.Успешно Тогда 
				Сообщить(Результат.ТекстОшибки);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
